# RebarInternalMultiplanarStartConnector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarInternalMultiplanarStartConnector Property
ParameterTypeId Class See Also
---
"INTERNAL: Multiplanar Start Connector"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarInternalMultiplanarStartConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInternalMultiplanarStartConnector As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarInternalMultiplanarStartConnector {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace